import { ItemResult } from "./itunesApi.ts";

export const SONGS_MOCK: ItemResult = {
    resultCount: 3,
    results: [
        {
            img_link: "",
            item_name: "ПАНЕЛЬ СОЛНЕЧНАЯ 285 ВТ 24 В ПОЛИ",
            short_description: 'General Energo!Мощность 210Вт!Поликристаллические, Grade A',
            item_cost: 10500,
            item_id: 0,
            long_description: "Солнечная панель представляет собой устройство, которое преобразует солнечный светв электрическую энергию, используя для этого множество объединённых в общую цепь фотоэлементов.Поликристаллические солнечные батареи – это разновидность солнечных панелей, которые производятся из поликристаллов кремния. Поликристалический кремний специально производят для фотоэлементов солнечных батарей. Больше нигде он не используется. Поликристаллические солнечные панели, внешне отличаются от других видов солнечных панелей, так как поликремний имеет неравномерный цвет с синеватым отливом.",
            specification: "Тип: Поликристаллические !Мощность, ВТ: 285 !Максимальный ток, А: 9.02 !Габариты, мм: 1640х992х35 !ДхШхВ: 1640х2х35 мм !Вес: 19г !ДхШхВ: 485х172х242 мм",
        },
        {
            img_link: "",
            item_name: "ПАНЕЛЬ СОЛНЕЧНАЯ 285 ВТ 24 В ПОЛИ",
            short_description: 'General Energo!Мощность 210Вт!Поликристаллические, Grade A',
            item_cost: 10500,
            item_id: 1,
            long_description: "Солнечная панель представляет собой устройство, которое преобразует солнечный светв электрическую энергию, используя для этого множество объединённых в общую цепь фотоэлементов.Поликристаллические солнечные батареи – это разновидность солнечных панелей, которые производятся из поликристаллов кремния. Поликристалический кремний специально производят для фотоэлементов солнечных батарей. Больше нигде он не используется. Поликристаллические солнечные панели, внешне отличаются от других видов солнечных панелей, так как поликремний имеет неравномерный цвет с синеватым отливом.",
            specification: "Тип: Поликристаллические !Мощность, ВТ: 285 !Максимальный ток, А: 9.02 !Габариты, мм: 1640х992х35 !ДхШхВ: 1640х2х35 мм !Вес: 19г !ДхШхВ: 485х172х242 мм",
        },
        {
            img_link: "",
            item_name: "ПАНЕЛЬ СОЛНЕЧНАЯ 285 ВТ 24 В ПОЛИ",
            short_description: 'General Energo!Мощность 210Вт!Поликристаллические, Grade A',
            item_cost: 10500,
            item_id: 2,
            long_description: "Солнечная панель представляет собой устройство, которое преобразует солнечный светв электрическую энергию, используя для этого множество объединённых в общую цепь фотоэлементов.Поликристаллические солнечные батареи – это разновидность солнечных панелей, которые производятся из поликристаллов кремния. Поликристалический кремний специально производят для фотоэлементов солнечных батарей. Больше нигде он не используется. Поликристаллические солнечные панели, внешне отличаются от других видов солнечных панелей, так как поликремний имеет неравномерный цвет с синеватым отливом.",
            specification: "Тип: Поликристаллические !Мощность, ВТ: 285 !Максимальный ток, А: 9.02 !Габариты, мм: 1640х992х35 !ДхШхВ: 1640х2х35 мм !Вес: 19г !ДхШхВ: 485х172х242 мм",
        },
        {
            img_link: "",
            item_name: "ПАНЕЛЬ СОЛНЕЧНАЯ 285 ВТ 24 В ПОЛИ",
            short_description: 'General Energo!Мощность 210Вт!Поликристаллические, Grade A',
            item_cost: 10500,
            item_id: 3,
            long_description: "Солнечная панель представляет собой устройство, которое преобразует солнечный светв электрическую энергию, используя для этого множество объединённых в общую цепь фотоэлементов.Поликристаллические солнечные батареи – это разновидность солнечных панелей, которые производятся из поликристаллов кремния. Поликристалический кремний специально производят для фотоэлементов солнечных батарей. Больше нигде он не используется. Поликристаллические солнечные панели, внешне отличаются от других видов солнечных панелей, так как поликремний имеет неравномерный цвет с синеватым отливом.",
            specification: "Тип: Поликристаллические !Мощность, ВТ: 285 !Максимальный ток, А: 9.02 !Габариты, мм: 1640х992х35 !ДхШхВ: 1640х2х35 мм !Вес: 19г !ДхШхВ: 485х172х242 мм",
        },
    ],
};
